app/controllers/api/v1/articles_controller.rb

INSERT INTO "articles" ("title", "body", "published", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Hello from Rails"], ["body", "Rails is love!"], ["published", "f"], ["created_at", "2017-07-14 08:31:57.847426"], ["updated_at", "2017-07-14 08:31:57.847426"]]
---
  def create
    @article = Article.new(article_params)
    if @article.save

UPDATE "articles" SET "title" = ?, "body" = ?, "published" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Hello from Angular"], ["body", "This is a sample from Angular"], ["published", "f"], ["updated_at", "2017-07-14 08:43:04.919425"], ["id", 9]]
---
  def update
    if @article.update(article_params)